#include <bits/stdc++.h>
using namespace std;

int main()
{
/////////////////////////////////////////////////////
/***********************入力************************/
    int N;
    cin >> N;
    vector<pair<int, int>> Aparam;//2つの要素をもつベクトル

    for(int i = 0; i < N; i++)
    {
        int A;
        cin >> A;//スコアの入力

        //スコアに番号をふることによってソートされても元の順番がなんだったかが分かる
        Aparam.push_back(make_pair(A, i+1));//0から始まっているからi+1に
    }

/////////////////////////////////////////////////////
/***********************演算************************/

    sort(Aparam.begin(), Aparam.end(), greater<pair<int, int>>());

/////////////////////////////////////////////////////
/***********************出力************************/
  cout << Aparam[1].second << endl;//元々の順番を出力
  return 0;
}